Table of Contents
 Class Segment2D
Namespace
IdeaRS.OpenModel.Geometry2D
Assembly
IdeaRS.OpenModel.dll
Represents a segment in two-dimensional space.
[KnownType(typeof(LineSegment2D))]
[KnownType(typeof(ArcSegment2D))]
[DataContract]
public abstract class Segment2D : OpenObject
Inheritance
object
OpenObject
Segment2D
Derived
ArcSegment2D
LineSegment2D
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 EndPoint
Gets or sets the endpoint of the segment.
[DataMember]
public Point2D EndPoint { get; set; }
Property Value
Point2D
 Edit this page